tap "nikitabobko/tap"
tap "fcoury/tap"

# Base CLI
brew "git"
brew "stow"
brew "mise"
brew "tmux"
brew "tpm"
brew "starship"
brew "zoxide"
brew "neovim"
brew "coreutils"
brew "wget"
brew "awscli@2"
brew "devcontainer"
brew "btop"
brew "git-crypt"
brew "gpg"
brew "telnet"
brew "aws-vault"
brew "cocoapods"
brew "bash"
brew "syncthing"
brew "fzf"
brew "ripgrep"
brew "jq"
brew "bat"
brew "eza"
brew "lazygit"
brew "delta"
brew "fd"
brew "yazi"
brew "opencode"
brew "gh"
brew "glow"
brew "tree-sitter-cli"
cask "claude-code"
cask "nikitabobko/tap/aerospace"
brew "mole"
brew "tsql"
uv "git+https://github.com/github/spec-kit.git"

# PostgreSQL tools
brew "libpq"

# Ruby dependencies
brew "libyaml"
brew "gmp"

# GUI (macOS)
cask "visual-studio-code"
cask "telegram"
cask "daisydisk"
cask "forklift"
cask "google-chrome"
cask "raycast"
cask "yandex-music"
cask "charles"
cask "postman"
cask "the-unarchiver"
# cask "google-drive"
cask "1password"
cask "slack"
cask "tableplus"
cask "medis"
cask "orbstack"
cask "claude"
cask "ghostty"
cask "finicky"
cask "1password-cli"
cask "zen"
cask "macwhisper"

# Fonts
cask "font-symbols-only-nerd-font"
cask "font-jetbrains-mono"
cask "font-maple-mono"
cask "font-ubuntu-mono"
cask "font-lilex"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
