tap "nikitabobko/tap"
tap "common-fate/granted"

# Base CLI
brew "git"
brew "stow"
brew "mise"
brew "tmux"
brew "neovim"
brew "coreutils"
brew "wget"
brew "awscli@2"
brew "devcontainer"
brew "btop"
brew "git-crypt"
brew "gpg"
brew "telnet"
brew "plantuml"
brew "granted"
brew "libpq"

# GUI (macOS)
cask "unifi-identity-enterprise"
cask "visual-studio-code"
cask "istat-menus"
cask "telegram"
cask "daisydisk"
cask "forklift"
cask "transmission"
cask "google-chrome"
cask "raycast"
cask "yandex-music"
cask "charles"
cask "postman"
cask "the-unarchiver"
# cask "google-drive"
cask "1password"
cask "slack"
cask "windows-app"
cask "tableplus"
cask "datagrip"
cask "medis"
cask "orbstack"
cask "chatgpt"
cask "ledger-live"
cask "zed@preview"
cask "iina"
# cask "aerospace"
cask "session-manager-plugin"
# cask "wezterm@nightly"
cask "ghostty"
cask "1password-cli"
cask "zen"
cask "figma"

# Fonts
cask "font-symbols-only-nerd-font"
cask "font-jetbrains-mono"
cask "font-maple-mono"
cask "font-ubuntu-mono"
cask "font-lilex"
cask "font-geist-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"

# Mac App Store helper (optional)
brew "mas"
