catppuccin/fish
patrickf1/fzf.fish
danhper/fish-ssh-agent
givensuman/fish-eza
jethrokuan/z
jorgebucaran/autopair.fish
wfxr/forgit
pure-fish/pure
